china-djyos/djyos/djysdk/djysrc/bsp/cpudrv/stm32f7/src/cpu_peri_nand.c
    if(NAND_WaitRB(0))
        return false;
    if(NAND_WaitRB(1))
        return false;
    return true;

}
//-----------------------------------------------------------------------------
//功能:
//参数: ChipName --
//      Clean -- 器件格式化;"1"--是;"0"--否。
//返回: "0" -- 成功;
//      "-1" -- 输入参数错误;
//      "-2" -- 内存不足;
//      "-3" -- 设备信息获取失败。
//备注:
//-----------------------------------------------------------------------------
s32 ModuleInstall_NAND(const char *ChipName, u32 Flags, u16 StartBlk)
{
    /*逻辑:
       1.芯片管脚等基本设置;
       2.(包括判断逻辑)获取芯片的信息;
       3.在dev分支下建立NAND节点;
       4.初始化NAND节点,包括FLASH的操作函数;
    */
    u32 Len;
    struct FlashChip *Chip;
    struct NandDescr ChipDesrc = {0};

    if (NULL == ChipName)
    {
        TraceDrv(FLASH_TRACE_ERROR, "unavailable param! \r\n");
        return (-1);
    }

    stm32f7_NAND_ControllerConfig();// 芯片管脚等基本配置

    // 获取NAND信息
    if(stm32f7_GetNandDescr(&ChipDesrc))
    {
        TraceDrv(FLASH_TRACE_ERROR, "解析NAND信息失败\r\n");
        gb_NandFlashReady=-3;
        return gb_NandFlashReady;
    }

    if(StartBlk >= ChipDesrc.BlksPerLUN * ChipDesrc.LUNs)
        return (-1);

    ChipDesrc.ReservedBlks = StartBlk;
    ChipDesrc.Controller = HW_ECC_SUPPORTED;
    ChipDesrc.BadMarkOffset = ChipDesrc.OOB_Size - 4 - 1;
    Len = strlen (ChipName) + 1;

    Chip = (struct FlashChip*)malloc(sizeof(struct FlashChip) + Len);
    if (NULL == Chip)
    {
        TraceDrv(FLASH_TRACE_ERROR, "out of memory!\r\n");
        gb_NandFlashReady=-2;
        return gb_NandFlashReady;
    }

    memset (Chip, 0x00, sizeof(*Chip));

    Chip->Type            = F_NAND;
    Chip->Descr.Nand      = ChipDesrc;
    Chip->Ops.RdPage      = stm32f7_PageRead;
    Chip->Ops.WrPage      = stm32f7_PageProgram;
    Chip->Ops.ErsBlk      = stm32f7_BlockErase;
    Chip->Ops.Special.Nand.ChkBlk = stm32f7_BadChk;
    Chip->Ops.Special.Nand.MrkBad = stm32f7_BadMark;

    strcpy(Chip->Name, ChipName);// 设备名

    s_ptNandInfo = (struct NandDescr *)&(Chip->Descr);

    Chip->Buf = (u8*)malloc(s_ptNandInfo->OOB_Size + s_ptNandInfo->BytesPerPage);// NAND底层缓冲
    if(NULL == Chip->Buf)
    {
        TraceDrv(FLASH_TRACE_ERROR, "out of memory!\r\n");
        free(Chip);
        gb_NandFlashReady=-2;
        return gb_NandFlashReady;
    }

    Driver_DeviceCreate(NULL, Chip->Name, NULL, NULL, NULL, NULL, NULL, NULL, (ptu32_t)Chip);// 设备接入"/dev"

    if(Flags & FLASH_ERASE_ALL)
        EarseWholeChip(Chip);
    gb_NandFlashReady=0;
    return (0);// 成功;
}



bool_t NandFlash_Ready(void)
{
	if(gb_NandFlashReady)
		return false;
	else
		return true;
}




/******************************************************************************
                         简易文件系统函数
******************************************************************************/
//#ifdef EFS_ON
//-----------------------------------------------------------------------------
//功能: 写小于一页的数据
//参数:
//返回:
//备注:
//-----------------------------------------------------------------------------






#define __WritePage(a,b,c) stm32f7_PageProgram(a,b,c)
#define __ReadPage(a,b,c) stm32f7_PageRead(a,b,c)
static s32 __WriteFragment(u32 PageNo, u32 Offset, const u8 *Buf, u32 Size)
{
    u32 i;
    s32 Ret;

    *(vu8*)(NAND_ADDRESS|NAND_CMD) = PAGE_PROGRAM_CMD_BYTE1;

    *(vu8*)(NAND_ADDRESS|NAND_ADDR) = (Offset);
    *(vu8*)(NAND_ADDRESS|NAND_ADDR) = (Offset>>8);
    *(vu8*)(NAND_ADDRESS|NAND_ADDR) = (PageNo);
    *(vu8*)(NAND_ADDRESS|NAND_ADDR) = (PageNo>>8);

    for(i = 0; i < Size; i++)
        *(vu8*)NAND_ADDRESS=(Buf[i]);

    *(vu8*)(NAND_ADDRESS|NAND_CMD) = PAGE_PROGRAM_CMD_BYTE2;

    Djy_EventDelay(700);// 切出
    WaitNandReady();// 时序要求
    Ret = StatusOfNand();
    if(Ret)
        return (-2);
    return (Size);
}

//-----------------------------------------------------------------------------
//功能: 读小于一页的数据
//参数:
//返回:
//备注:
//-----------------------------------------------------------------------------
static s32 __ReadFragment(u32 PageNo, u32 Offset, u8 *Buf, u32 Size)
{
    u32 i;
    s32 Ret;

    WaitNandReady();

    *(vu8*)(NAND_ADDRESS|NAND_CMD)=(PAGE_READ_CMD_BYTE1);
    *(vu8*)(NAND_ADDRESS|NAND_ADDR) = (Offset);
    *(vu8*)(NAND_ADDRESS|NAND_ADDR) = (Offset>>8);
    *(vu8*)(NAND_ADDRESS|NAND_ADDR) = (PageNo);
    *(vu8*)(NAND_ADDRESS|NAND_ADDR) = (PageNo>>8);
    *(vu8*)(NAND_ADDRESS|NAND_CMD)=(PAGE_READ_CMD_BYTE2);

    Djy_EventDelay(25);
    WaitNandReady(); // 时序要求

    for(i = 0; i < Size; i++)
        Buf[i] = (*(vu8*)NAND_ADDRESS);

    Ret = StatusOfNand();

    if(Ret)
        return (-2);

    return (Size);
}
//-----------------------------------------------------------------------------
//功能: 写数据
//参数: BlkNo -- 块号;
//      Offset -- 块内偏置;
//      Buf -- 写缓冲;
//      Size -- 写数据大小
//      Flags -- 0x0 -- 无功能; 0x1 - ECC功能开启(数据大小为必须256)
//返回:
//备注:
//-----------------------------------------------------------------------------
u32 EFS_IF_WriteData(u32 BlkNo, u32 Offset, u8 *Buf, u32 Size, u8 Flags)
{
    s32 Ret;
    u32 PageNo = (BlkNo << 6) + (Offset >> 11);
    u32 PageOffset = Offset & 0x7FF;
    u32 WrLen = Size;

    if(!Buf)
        return (0);

    // ECC的数据源为256字节，放入数据后端,3个字节
    if(1 == Flags)
    {
        hamming_compute_256x(Buf, 256, Buf+256);
        WrLen = Size + 3;
        PageOffset += 3 * (PageOffset >> 8);
    }

    for(;;)
    {
        if((!PageOffset) && (WrLen >= s_ptNandInfo->BytesPerPage))
            Ret = __WritePage(PageNo, Buf, NO_ECC);
        else if((WrLen >= s_ptNandInfo->BytesPerPage) || // 写数据大与等于一页,但内容跨页
                (((WrLen+PageOffset) > s_ptNandInfo->BytesPerPage) && (!Flags))) // 写数据小于一页,但内容跨页(只有考虑非ECC的情况)
            Ret = __WriteFragment(PageNo, PageOffset, (const u8*)Buf, (s_ptNandInfo->BytesPerPage - PageOffset));
        else
            Ret = __WriteFragment(PageNo, PageOffset, (const u8*)Buf, WrLen);

        if(Ret <= 0)
            break;// 错误或者已写完

        WrLen -= Ret;
        if(WrLen <= 0)
            break;
        Buf += Ret;
        PageNo++;
        if(PageOffset)
            PageOffset = 0;
    }

    if(Ret > 0)
        return (Size);
    else
        return (0);
}
//-----------------------------------------------------------------------------
//功能: 读数据
//参数: BlkNo -- 块号;
//      Offset -- 块内偏置;
//      Buf -- 读缓冲;
//      Size -- 读数据大小
//      Flags -- 0x0 -- 无功能; 0x1 - ECC功能开启(数据大小为必须256)
//返回:
//备注:
//-----------------------------------------------------------------------------
u32 EFS_IF_ReadData(u32 BlkNo, u32 Offset, u8 *Buf, u32 Size, u8 Flags)
{
    s32 Ret;
    u32 PageNo = (BlkNo << 6) + (Offset >> 11);
    u32 PageOffset = Offset & 0x7FF;
    u32 RdLen = Size;

    if(!Buf)
        return (0);

    if(1 == Flags)
    {
        RdLen += 3;
        PageOffset += 3 * (PageOffset >> 8);
    }

    for(;;)
    {
        if((!PageOffset) && (RdLen >= s_ptNandInfo->BytesPerPage))
            Ret = __ReadPage(PageNo, Buf, NO_ECC);
        else if((RdLen >= s_ptNandInfo->BytesPerPage) || // 写数据大与等于一页,但内容跨页
                (((RdLen+PageOffset) > s_ptNandInfo->BytesPerPage) && (!Flags))) // 读数据小于一页,但内容跨页(只有非ECC的情况需要考虑)
            Ret = __ReadFragment(PageNo, PageOffset, Buf, (s_ptNandInfo->BytesPerPage - PageOffset));
        else
            Ret = __ReadFragment(PageNo, PageOffset, Buf, RdLen);

